// 说    明: 硬件连接：
//						STM32H750			单路AD9226模块
//							+5V			-> 			+5V
//							GND			->			GND
// 			改 PD14					-> 		AD9226_CLK        设置为PWM输出模式给定时钟频率 
// 			改	PD10			-> 		AD9226_D11
// 			改	PD15			-> 		AD9226_D10
// 			改	PD9				-> 		AD9226_D9
// 			改	PD0				-> 		AD9226_D8
// 			改	PD8				-> 		AD9226_D7
// 			改	PD1				-> 		AD9226_D6			12个寄存器通道都设置为输入模式+高速 (不要内部上拉电阻，浮空输入即可） 
// 			改	PE15			-> 		AD9226_D5
// 			改	PE7			    -> 		AD9226_D4
// 			改	PE14			-> 		AD9226_D3
// 			改	PE8	     	-> 		AD9226_D2
// 			改	PE13			-> 		AD9226_D1
// 			改 PE9				-> 		AD9226_D0
// 			改 PE12				-> 		AD9226_OTR     也许要设置为推挽输出模式+内部上拉电阻+高速 （用于溢出处理，一般不用管） 



 
//-----------------------------------------------------------------
#ifndef _AD9226_H
#define _AD9226_H
//#include "system.h"
#include "main.h"
#include "gpio.h"
//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------
extern uint16_t getonedata(void); 
extern void movedata1(uint16_t i);

extern uint16_t data_bit;//adc单次采样的数据
extern uint16_t data1[4096];
#endif
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
